Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
 (known after apply),
+       (known after apply),
    ]
+   intra_subnets_cidr_blocks                   = [
+       "10.50.96.0/22",
+       "10.50.100.0/22",
+       "10.50.104.0/22",
    ]
+   intra_subnets_ipv6_cidr_blocks              = []
+   name                                        = "scde-dev-us-east-1"
+   nat_ids                                     = [
+       (known after apply),
    ]
+   nat_public_ips                              = [
+       (known after apply),
    ]
+   natgw_ids                                   = [
+       (known after apply),
    ]
+   outpost_subnet_arns                         = []
+   outpost_subnets                             = []
+   outpost_subnets_cidr_blocks                 = []
+   outpost_subnets_ipv6_cidr_blocks            = []
+   private_ipv6_egress_route_ids               = []
+   private_nat_gateway_route_ids               = [
+       (known after apply),
    ]
+   private_route_table_association_ids         = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   private_route_table_ids                     = [
+       (known after apply),
    ]
+   private_subnet_arns                         = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   private_subnets                             = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   private_subnets_cidr_blocks                 = [
+       "10.50.48.0/20",
+       "10.50.64.0/20",
+       "10.50.80.0/20",
    ]
+   private_subnets_ipv6_cidr_blocks            = []
+   public_internet_gateway_route_id            = (known after apply)
+   public_route_table_association_ids          = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   public_route_table_ids                      = [
+       (known after apply),
    ]
+   public_subnet_arns                          = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   public_subnets                              = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   public_subnets_cidr_blocks                  = [
+       "10.50.0.0/20",
+       "10.50.16.0/20",
+       "10.50.32.0/20",
    ]
+   public_subnets_ipv6_cidr_blocks             = []
+   redshift_public_route_table_association_ids = []
+   redshift_route_table_association_ids        = []
+   redshift_route_table_ids                    = [
+       (known after apply),
    ]
+   redshift_subnet_arns                        = []
+   redshift_subnets                            = []
+   redshift_subnets_cidr_blocks                = []
+   redshift_subnets_ipv6_cidr_blocks           = []
+   this_customer_gateway                       = {}
+   vpc_arn                                     = (known after apply)
+   vpc_cidr_block                              = "10.50.0.0/16"
+   vpc_enable_dns_hostnames                    = true
+   vpc_enable_dns_support                      = true
+   vpc_flow_log_cloudwatch_iam_role_arn        = ""
+   vpc_flow_log_destination_arn                = ""
+   vpc_flow_log_destination_type               = "cloud-watch-logs"
+   vpc_id                                      = (known after apply)
+   vpc_instance_tenancy                        = "default"
+   vpc_ipv6_association_id                     = (known after apply)
+   vpc_ipv6_cidr_block                         = (known after apply)
+   vpc_main_route_table_id                     = (known after apply)
+   vpc_owner_id                                = (known after apply)
+   vpc_secondary_cidr_blocks                   = []
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/aws/us-east-1/dev/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Faws%252Fus-east-1%252Fdev%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/aws/us-east-1/dev/vpc`
</details>
Plan: 27 to add, 0 to change, 0 to destroy.

---
### 17. dir: `infra/aws/us-east-1/mgmt/ecr` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2024-01-15T18:47:42Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-ecr.git. Relative paths in downloaded Terraform code may not work.

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 4.22.0"...
- Installing hashicorp/aws v5.32.1...
- Installed hashicorp/aws v5.32.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!
data.aws_caller_identity.current: Reading...
data.aws_partition.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Read complete after 0s [id=677160962006]
data.aws_iam_policy_document.repository[0]: Reading...
data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=3792795651]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.this[0] will be created
+   resource "aws_ecr_lifecycle_policy" "this" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               rules = [
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "keep last 20 images"
+                       rulePriority = 10
+                       selection    = {
+                           countNumber = 20
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "any"
                        }
                    },
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Expire untagged images older than 14 days"
+                       rulePriority = 1
+                       selection    = {
+                           countNumber = 1
+                           countType   = "sinceImagePushed"
+                           countUnit   = "days"
+                           tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
+       registry_id = (known after apply)
+       repository  = "scde"
    }

  # aws_ecr_repository.this[0] will be created
+   resource "aws_ecr_repository" "this" {
+       arn                  = (known after apply)
+       id                   = (known after apply)
+       image_tag_mutability = "IMMUTABLE"
+       name                 = "scde"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags_all             = (known after apply)

+       encryption_configuration {
+           encryption_type = "AES256"
+           kms_key         = (known after apply)
        }

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

  # aws_ecr_repository_policy.this[0] will be created
+   resource "aws_ecr_repository_policy" "this" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = [
+                           "ecr:ListTagsForResource",
+                           "ecr:ListImages",
+                           "ecr:GetRepositoryPolicy",
+                           "ecr:GetLifecyclePolicyPreview",
+                           "ecr:GetLifecyclePolicy",
+                           "ecr:GetDownloadUrlForLayer",
+                           "ecr:GetAuthorizationToken",
+                           "ecr:DescribeRepositories",
+                           "ecr:DescribeImages",
+                           "ecr:DescribeImageScanFindings",
+                           "ecr:BatchGetImage",
+                           "ecr:BatchCheckLayerAvailability",
                        ]
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::677160962006:root"
                        }
+                       Sid       = "PrivateReadOnly"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       registry_id = (known after apply)
+       repository  = "scde"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   repository_arn         = (known after apply)
+   repository_registry_id = (known after apply)
+   repository_url         = (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/aws/us-east-1/mgmt/ecr`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Faws%252Fus-east-1%252Fmgmt%252Fecr%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/aws/us-east-1/mgmt/ecr`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 18. dir: `infra/aws/us-east-1/mgmt/peering/dev` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/mgmt/peering/dev": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/mgmt/peering/dev": 
time=2024-01-15T18:47:59Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-vpc.git. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/mgmt/vpc] 
time=2024-01-15T18:48:00Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/mgmt/vpc/terragrunt.hcl is a dependency of /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/mgmt/peering/dev/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
time=2024-01-15T18:48:00Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 19. dir: `infra/aws/us-east-1/mgmt/peering/prod` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/mgmt/peering/prod": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/mgmt/peering/prod": 
time=2024-01-15T18:48:01Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-vpc.git. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/mgmt/vpc] 
time=2024-01-15T18:48:02Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/mgmt/vpc/terragrunt.hcl is a dependency of /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/mgmt/peering/prod/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
time=2024-01-15T18:48:02Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 20. dir: `infra/aws/us-east-1/mgmt/vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2024-01-15T18:48:03Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-vpc.git. Relative paths in downloaded Terraform code may not work.

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 5.0.0"...
- Installing hashicorp/aws v5.32.1...
- Installed hashicorp/aws v5.32.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name" = "management-vpc"
        }
+       tags_all = {
+           "Environment"  = "mgmt"
+           "Name"         = "management-vpc"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id   = (known after apply)
    }

  # aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "management-vpc-public"
        }
+       tags_all         = {
+           "Environment"  = "mgmt"
+           "Name"         = "management-vpc-public"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id           = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.100.0.0/20"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "management-vpc-public-subnet"
        }
+       tags_all                                       = {
+           "Environment"  = "mgmt"
+           "Name"         = "management-vpc-public-subnet"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.100.16.0/20"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "management-vpc-public-subnet"
        }
+       tags_all                                       = {
+           "Environment"  = "mgmt"
+           "Name"         = "management-vpc-public-subnet"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.100.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name" = "management-vpc"
        }
+       tags_all                             = {
+           "Environment"  = "mgmt"
+           "Name"         = "management-vpc"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   azs                                         = [
+       "us-east-1a",
+       "us-east-1b",
    ]
+   cgw_arns                                    = []
+   cgw_ids                                     = []
+   database_nat_gateway_route_ids              = []
+   database_route_table_association_ids        = []
+   database_route_table_ids                    = []
+   database_subnet_arns                        = []
+   database_subnets                            = []
+   database_subnets_cidr_blocks                = []
+   database_subnets_ipv6_cidr_blocks           = []
+   default_network_acl_id                      = (known after apply)
+   default_route_table_id                      = (known after apply)
+   default_security_group_id                   = (known after apply)
+   elasticache_route_table_association_ids     = []
+   elasticache_route_table_ids                 = []
+   elasticache_subnet_arns                     = []
+   elasticache_subnets                         = []
+   elasticache_subnets_cidr_blocks             = []
+   elasticache_subnets_ipv6_cidr_blocks        = []
+   igw_arn                                     = (known after apply)
+   igw_id                                      = (known after apply)
+   intra_route_table_association_ids           = []
+   intra_route_table_ids                       = []
+   intra_subnet_arns                           = []
+   intra_subnets                               = []
+   intra_subnets_cidr_blocks                   = []
+   intra_subnets_ipv6_cidr_blocks              = []
+   name                                        = "management-vpc"
+   nat_ids                                     = []
+   nat_public_ips                              = []
+   natgw_ids                                   = []
+   outpost_subnet_arns                         = []
+   outpost_subnets                             = []
+   outpost_subnets_cidr_blocks                 = []
+   outpost_subnets_ipv6_cidr_blocks            = []
+   private_ipv6_egress_route_ids               = []
+   private_nat_gateway_route_ids               = []
+   private_route_table_association_ids         = []
+   private_route_table_ids                     = []
+   private_subnet_arns                         = []
+   private_subnets                             = []
+   private_subnets_cidr_blocks                 = []
+   private_subnets_ipv6_cidr_blocks            = []
+   public_internet_gateway_route_id            = (known after apply)
+   public_route_table_association_ids          = [
+       (known after apply),
+       (known after apply),
    ]
+   public_route_table_ids                      = [
+       (known after apply),
    ]
+   public_subnet_arns                          = [
+       (known after apply),
+       (known after apply),
    ]
+   public_subnets                              = [
+       (known after apply),
+       (known after apply),
    ]
+   public_subnets_cidr_blocks                  = [
+       "10.100.0.0/20",
+       "10.100.16.0/20",
    ]
+   public_subnets_ipv6_cidr_blocks             = []
+   redshift_public_route_table_association_ids = []
+   redshift_route_table_association_ids        = []
+   redshift_route_table_ids                    = []
+   redshift_subnet_arns                        = []
+   redshift_subnets                            = []
+   redshift_subnets_cidr_blocks                = []
+   redshift_subnets_ipv6_cidr_blocks           = []
+   this_customer_gateway                       = {}
+   vpc_arn                                     = (known after apply)
+   vpc_cidr_block                              = "10.100.0.0/16"
+   vpc_enable_dns_hostnames                    = true
+   vpc_enable_dns_support                      = true
+   vpc_flow_log_cloudwatch_iam_role_arn        = ""
+   vpc_flow_log_destination_arn                = ""
+   vpc_flow_log_destination_type               = "cloud-watch-logs"
+   vpc_id                                      = (known after apply)
+   vpc_instance_tenancy                        = "default"
+   vpc_ipv6_association_id                     = (known after apply)
+   vpc_ipv6_cidr_block                         = (known after apply)
+   vpc_main_route_table_id                     = (known after apply)
+   vpc_owner_id                                = (known after apply)
+   vpc_secondary_cidr_blocks                   = []
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/aws/us-east-1/mgmt/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Faws%252Fus-east-1%252Fmgmt%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/aws/us-east-1/mgmt/vpc`
</details>
Plan: 8 to add, 0 to change, 0 to destroy.

---
### 21. dir: `infra/aws/us-east-1/prod/eks/green/application-secrets` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/application-secrets": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/application-secrets": 
time=2024-01-15T18:48:21Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/modules/eks. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/eks] 
time=2024-01-15T18:48:21Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/eks/terragrunt.hcl is a dependency of /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/application-secrets/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
time=2024-01-15T18:48:21Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 22. dir: `infra/aws/us-east-1/prod/eks/green/eks-addons` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/eks-addons": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/eks-addons": 
time=2024-01-15T18:48:23Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/modules/eks. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/eks] 
time=2024-01-15T18:48:24Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/eks/terragrunt.hcl is a dependency of /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/eks-addons/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
time=2024-01-15T18:48:24Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 23. dir: `infra/aws/us-east-1/prod/eks/green/eks` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/eks": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/eks": 
time=2024-01-15T18:48:25Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/vpc/terragrunt.hcl is a dependency of /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/eks/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
time=2024-01-15T18:48:25Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 24. dir: `infra/aws/us-east-1/prod/eks/green/grafana-agent` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/grafana-agent": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/grafana-agent": 
time=2024-01-15T18:48:26Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/modules/eks. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/eks] 
time=2024-01-15T18:48:27Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/global/route53/records/us-east-2.vpce.grafana.net/terragrunt.hcl is a dependency of /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/grafana-agent/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
time=2024-01-15T18:48:27Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 25. dir: `infra/aws/us-east-1/prod/eks/green/kubevela-addons` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/kubevela-addons": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/kubevela-addons": 
time=2024-01-15T18:48:28Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/modules/eks. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/eks] 
time=2024-01-15T18:48:29Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/eks/terragrunt.hcl is a dependency of /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/kubevela-addons/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
time=2024-01-15T18:48:29Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 26. dir: `infra/aws/us-east-1/prod/kms` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2024-01-15T18:48:30Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-kms.git. Relative paths in downloaded Terraform code may not work.

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 4.33.0"...
- Installing hashicorp/aws v5.32.1...
- Installed hashicorp/aws v5.32.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!
data.aws_partition.current[0]: Reading...
data.aws_caller_identity.current[0]: Reading...
data.aws_partition.current[0]: Read complete after 0s [id=aws]
data.aws_caller_identity.current[0]: Read complete after 0s [id=677160962006]
data.aws_iam_policy_document.this[0]: Reading...
data.aws_iam_policy_document.this[0]: Read complete after 0s [id=1445808354]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_kms_alias.this["dapps-world"] will be created
+   resource "aws_kms_alias" "this" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       name           = "alias/dapps-world"
+       name_prefix    = (known after apply)
+       target_key_arn = (known after apply)
+       target_key_id  = (known after apply)
    }

  # aws_kms_key.this[0] will be created
+   resource "aws_kms_key" "this" {
+       arn                                = (known after apply)
+       bypass_policy_lockout_safety_check = false
+       customer_master_key_spec           = "SYMMETRIC_DEFAULT"
+       description                        = (known after apply)
+       enable_key_rotation                = false
+       id                                 = (known after apply)
+       is_enabled                         = true
+       key_id                             = (known after apply)
+       key_usage                          = "ENCRYPT_DECRYPT"
+       multi_region                       = false
+       policy                             = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "kms:*"
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::677160962006:root"
                        }
+                       Resource  = "*"
+                       Sid       = "KeyOwner"
                    },
+                   {
+                       Action    = [
+                           "kms:Update*",
+                           "kms:UntagResource",
+                           "kms:TagResource",
+                           "kms:ScheduleKeyDeletion",
+                           "kms:Revoke*",
+                           "kms:ReplicateKey",
+                           "kms:Put*",
+                           "kms:List*",
+                           "kms:ImportKeyMaterial",
+                           "kms:Get*",
+                           "kms:Enable*",
+                           "kms:Disable*",
+                           "kms:Describe*",
+                           "kms:Delete*",
+                           "kms:Create*",
+                           "kms:CancelKeyDeletion",
                        ]
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = [
+                               "arn:aws:iam::677160962006:user/shea.levy",
+                               "arn:aws:iam::677160962006:user/rene.barbosa",
+                               "arn:aws:iam::677160962006:user/olaniyi.oshunbote",
+                               "arn:aws:iam::677160962006:user/oguzhan.boran",
+                               "arn:aws:iam::677160962006:user/fenton.haslam",
+                               "arn:aws:iam::677160962006:user/daniel.thagard",
+                               "arn:aws:iam::677160962006:user/alexsander.falcucci",
+                               "arn:aws:iam::677160962006:role/dapps-world",
+                               "arn:aws:iam::677160962006:role/OrganizationAccountAccessRole",
                            ]
                        }
+                       Resource  = "*"
+                       Sid       = "KeyAdministration"
                    },
+                   {
+                       Action    = [
+                           "kms:ReEncrypt*",
+                           "kms:GenerateDataKey*",
+                           "kms:Encrypt",
+                           "kms:DescribeKey",
+                           "kms:Decrypt",
                        ]
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = [
+                               "arn:aws:iam::677160962006:user/shea.levy",
+                               "arn:aws:iam::677160962006:user/rene.barbosa",
+                               "arn:aws:iam::677160962006:user/olaniyi.oshunbote",
+                               "arn:aws:iam::677160962006:user/oguzhan.boran",
+                               "arn:aws:iam::677160962006:user/fenton.haslam",
+                               "arn:aws:iam::677160962006:user/daniel.thagard",
+                               "arn:aws:iam::677160962006:user/alexsander.falcucci",
+                               "arn:aws:iam::677160962006:role/dapps-world",
+                               "arn:aws:iam::677160962006:role/OrganizationAccountAccessRole",
                            ]
                        }
+                       Resource  = "*"
+                       Sid       = "KeyUsage"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       tags_all                           = {
+           "Environment"  = "prod"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   aliases                       = {
+       dapps-world = {
+           arn            = (known after apply)
+           id             = (known after apply)
+           name           = "alias/dapps-world"
+           name_prefix    = (known after apply)
+           target_key_arn = (known after apply)
+           target_key_id  = (known after apply)
        }
    }
+   grants                        = {}
+   key_arn                       = (known after apply)
+   key_id                        = (known after apply)
+   key_policy                    = jsonencode(
        {
+           Statement = [
+               {
+                   Action    = "kms:*"
+                   Effect    = "Allow"
+                   Principal = {
+                       AWS = "arn:aws:iam::677160962006:root"
                    }
+                   Resource  = "*"
+                   Sid       = "KeyOwner"
                },
+               {
+                   Action    = [
+                       "kms:Update*",
+                       "kms:UntagResource",
+                       "kms:TagResource",
+                       "kms:ScheduleKeyDeletion",
+                       "kms:Revoke*",
+                       "kms:ReplicateKey",
+                       "kms:Put*",
+                       "kms:List*",
+                       "kms:ImportKeyMaterial",
+                       "kms:Get*",
+                       "kms:Enable*",
+                       "kms:Disable*",
+                       "kms:Describe*",
+                       "kms:Delete*",
+                       "kms:Create*",
+                       "kms:CancelKeyDeletion",
                    ]
+                   Effect    = "Allow"
+                   Principal = {
+                       AWS = [
+                           "arn:aws:iam::677160962006:user/shea.levy",
+                           "arn:aws:iam::677160962006:user/rene.barbosa",
+                           "arn:aws:iam::677160962006:user/olaniyi.oshunbote",
+                           "arn:aws:iam::677160962006:user/oguzhan.boran",
+                           "arn:aws:iam::677160962006:user/fenton.haslam",
+                           "arn:aws:iam::677160962006:user/daniel.thagard",
+                           "arn:aws:iam::677160962006:user/alexsander.falcucci",
+                           "arn:aws:iam::677160962006:role/dapps-world",
+                           "arn:aws:iam::677160962006:role/OrganizationAccountAccessRole",
                        ]
                    }
+                   Resource  = "*"
+                   Sid       = "KeyAdministration"
                },
+               {
+                   Action    = [
+                       "kms:ReEncrypt*",
+                       "kms:GenerateDataKey*",
+                       "kms:Encrypt",
+                       "kms:DescribeKey",
+                       "kms:Decrypt",
                    ]
+                   Effect    = "Allow"
+                   Principal = {
+                       AWS = [
+                           "arn:aws:iam::677160962006:user/shea.levy",
+                           "arn:aws:iam::677160962006:user/rene.barbosa",
+                           "arn:aws:iam::677160962006:user/olaniyi.oshunbote",
+                           "arn:aws:iam::677160962006:user/oguzhan.boran",
+                           "arn:aws:iam::677160962006:user/fenton.haslam",
+                           "arn:aws:iam::677160962006:user/daniel.thagard",
+                           "arn:aws:iam::677160962006:user/alexsander.falcucci",
+                           "arn:aws:iam::677160962006:role/dapps-world",
+                           "arn:aws:iam::677160962006:role/OrganizationAccountAccessRole",
                        ]
                    }
+                   Resource  = "*"
+                   Sid       = "KeyUsage"
                },
            ]
+           Version   = "2012-10-17"
        }
    )
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/aws/us-east-1/prod/kms`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Faws%252Fus-east-1%252Fprod%252Fkms%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/aws/us-east-1/prod/kms`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 27. dir: `infra/aws/us-east-1/prod/peering/dapps-old` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/peering/dapps-old": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/peering/dapps-old": 
time=2024-01-15T18:48:48Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/vpc/terragrunt.hcl is a dependency of /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/peering/dapps-old/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
time=2024-01-15T18:48:48Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 28. dir: `infra/aws/us-east-1/prod/peering/grafana` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/peering/grafana": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/peering/grafana": 
time=2024-01-15T18:48:49Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-vpc.git. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-2/prod/grafana/vpc] 
time=2024-01-15T18:48:50Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-2/prod/grafana/vpc/terragrunt.hcl is a dependency of /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/peering/grafana/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
time=2024-01-15T18:48:50Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 29. dir: `infra/aws/us-east-1/prod/rds/bastion/ec2-instance` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/bastion/ec2-instance": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/bastion/ec2-instance": 
time=2024-01-15T18:48:50Z level=error msg=Error reading file at path /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/blue/eks: open /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/blue/eks: no such file or directory
time=2024-01-15T18:48:50Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 30. dir: `infra/aws/us-east-1/prod/rds/bastion/key-pair` workspace: `default`
<details><summary>Show Output</summary>

```diff
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 4.21.0"...
- Finding hashicorp/tls versions matching ">= 3.4.0"...
- Installing hashicorp/aws v5.32.1...
- Installed hashicorp/aws v5.32.1 (signed by HashiCorp)
- Installing hashicorp/tls v4.0.5...
- Installed hashicorp/tls v4.0.5 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_key_pair.this[0] will be created
+   resource "aws_key_pair" "this" {
+       arn             = (known after apply)
+       fingerprint     = (known after apply)
+       id              = (known after apply)
+       key_name        = "scde-marlowe-runtime-db-bastion-kp"
+       key_name_prefix = (known after apply)
+       key_pair_id     = (known after apply)
+       key_type        = (known after apply)
+       public_key      = (known after apply)
+       tags_all        = {
+           "Environment"  = "prod"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
    }

  # tls_private_key.this[0] will be created
+   resource "tls_private_key" "this" {
+       algorithm                     = "RSA"
+       ecdsa_curve                   = "P224"
+       id                            = (known after apply)
+       private_key_openssh           = (sensitive value)
+       private_key_pem               = (sensitive value)
+       private_key_pem_pkcs8         = (sensitive value)
+       public_key_fingerprint_md5    = (known after apply)
+       public_key_fingerprint_sha256 = (known after apply)
+       public_key_openssh            = (known after apply)
+       public_key_pem                = (known after apply)
+       rsa_bits                      = 4096
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   key_pair_arn                  = (known after apply)
+   key_pair_fingerprint          = (known after apply)
+   key_pair_id                   = (known after apply)
+   key_pair_name                 = "scde-marlowe-runtime-db-bastion-kp"
+   private_key_id                = (known after apply)
+   private_key_openssh           = (sensitive value)
+   private_key_pem               = (sensitive value)
+   public_key_fingerprint_md5    = (known after apply)
+   public_key_fingerprint_sha256 = (known after apply)
+   public_key_openssh            = (known after apply)
+   public_key_pem                = (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/aws/us-east-1/prod/rds/bastion/key-pair`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Faws%252Fus-east-1%252Fprod%252Frds%252Fbastion%252Fkey-pair%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/aws/us-east-1/prod/rds/bastion/key-pair`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 31. dir: `infra/aws/us-east-1/prod/rds/bastion/security-group` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/bastion/security-group": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/bastion/security-group": 
time=2024-01-15T18:49:05Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/vpc/terragrunt.hcl is a dependency of /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/bastion/security-group/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
time=2024-01-15T18:49:05Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 32. dir: `infra/aws/us-east-1/prod/rds/looker-studio-db` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/looker-studio-db": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/looker-studio-db": 
time=2024-01-15T18:49:06Z level=error msg=Error reading file at path /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/looker-studio-db/terragrunt.hcl: open /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/looker-studio-db/terragrunt.hcl: no such file or directory
time=2024-01-15T18:49:06Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 33. dir: `infra/aws/us-east-1/prod/rds/prod-marlowe-runtime-benchmark-db` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/prod-marlowe-runtime-benchmark-db": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/prod-marlowe-runtime-benchmark-db": 
time=2024-01-15T18:49:07Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/modules/eks. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/eks] 
time=2024-01-15T18:49:08Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/vpc/terragrunt.hcl is a dependency of /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/prod-marlowe-runtime-benchmark-db/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
time=2024-01-15T18:49:08Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 34. dir: `infra/aws/us-east-1/prod/rds/prod-marlowe-runtime-db` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/prod-marlowe-runtime-db": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/prod-marlowe-runtime-db": 
time=2024-01-15T18:49:09Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/modules/eks. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/eks/green/eks] 
time=2024-01-15T18:49:10Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/security-group-jingles/terragrunt.hcl is a dependency of /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/prod-marlowe-runtime-db/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
time=2024-01-15T18:49:10Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 35. dir: `infra/aws/us-east-1/prod/rds/security-group-jingles` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/security-group-jingles": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/security-group-jingles": 
time=2024-01-15T18:49:11Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/vpc/terragrunt.hcl is a dependency of /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/security-group-jingles/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
time=2024-01-15T18:49:11Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 36. dir: `infra/aws/us-east-1/prod/rds/security-group` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/security-group": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/security-group": 
time=2024-01-15T18:49:12Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/vpc/terragrunt.hcl is a dependency of /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/security-group/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
time=2024-01-15T18:49:12Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 37. dir: `infra/aws/us-east-1/prod/rds/subnet-group` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/subnet-group": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/subnet-group": 
time=2024-01-15T18:49:14Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/vpc/terragrunt.hcl is a dependency of /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/prod/rds/subnet-group/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
time=2024-01-15T18:49:14Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 38. dir: `infra/aws/us-east-1/prod/vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 5.0.0"...
- Installing hashicorp/aws v5.32.1...
- Installed hashicorp/aws v5.32.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.nat[0] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Name" = "scde-prod-us-east-1-us-east-1a"
        }
+       tags_all             = {
+           "Environment"  = "prod"
+           "Name"         = "scde-prod-us-east-1-us-east-1a"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc                  = (known after apply)
    }

  # aws_eip.nat[1] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Name" = "scde-prod-us-east-1-us-east-1b"
        }
+       tags_all             = {
+           "Environment"  = "prod"
+           "Name"         = "scde-prod-us-east-1-us-east-1b"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc                  = (known after apply)
    }

  # aws_eip.nat[2] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Name" = "scde-prod-us-east-1-us-east-1c"
        }
+       tags_all             = {
+           "Environment"  = "prod"
+           "Name"         = "scde-prod-us-east-1-us-east-1c"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc                  = (known after apply)
    }

  # aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name" = "scde-prod-us-east-1"
        }
+       tags_all = {
+           "Environment"  = "prod"
+           "Name"         = "scde-prod-us-east-1"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id   = (known after apply)
    }

  # aws_nat_gateway.this[0] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Name" = "scde-prod-us-east-1-us-east-1a"
        }
+       tags_all                           = {
+           "Environment"  = "prod"
+           "Name"         = "scde-prod-us-east-
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.